package Vn.Ships.Cargo {
//-----------------------------------------------------------------------------------------------------
// Менеджер грузов на корабле
//-----------------------------------------------------------------------------------------------------
	import Vn.Cargo.CargoManagerVn;
	import Vn.Cargo.CargoVn;
	import Vn.Ships.Ship;
//-----------------------------------------------------------------------------------------------------
	public class ShipCargoManagerVn extends CargoManagerVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ShipCargoManagerVn(vOwner:Ship) {
			// Конструктор родителя
			super(vOwner);
			// Конструктор
			Script = "getshipcargo.php";
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор родителя
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function CreateListFromXML(Data:XML):void {
			// Создание списка по полученным XML-данным
			for each (var Node:XML in Data.*) {
				if (Node.nodeKind() == "element") {
					var ShipCargo:CargoVn = new ShipCargoVn(Owner);
					ShipCargoVn(ShipCargo).Id = uint(Node.attribute("id"));	// vn_user_ships_cargo.id
					ShipCargo.industryId = uint(Node.child("industry_id"));	// vn_industry.id
					ShipCargo.Type = uint(Node.child("type"));
					ShipCargoVn(ShipCargo).SourceId = uint(Node.child("cargo_source"));
					ShipCargo.Volume = uint(Node.child("cargo_volume"));
					ShipCargoVn(ShipCargo).SourcePrice = uint(Node.child("cargo_price"));
					Add(ShipCargo);
				}
			}
		}
//-----------------------------------------------------------------------------------------------------
		override protected function SetScriptParams():void {
			// Добавление загрузочных параметров в загрузчик
			AddScriptParam("ShipId", String(Ship(Owner).RegNo));
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}