package Vn.Ships.Cargo {
//-----------------------------------------------------------------------------------------------------
// Страничный компонент со списком грцзов на корабле для торговли
//-----------------------------------------------------------------------------------------------------
	import Vn.Cargo.CargoListVn;
	import Vn.Cargo.CargoVn;
//	import Vn.Debug.ImgBorder;
	import Vn.Math.Vector2;
	import Vn.Ships.Ship;
//-----------------------------------------------------------------------------------------------------
	public class ShipCargoListVn extends CargoListVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ShipCargoListVn(vSize:Vector2) {
			// Конструктор предка
			super(vSize);
			// Конструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function OnCargoRefreshed(vOwner:Object):void {
			// Заполнить список
			for each (var CurrnetCargo:CargoVn in Ship(vOwner).CargoManager.All) {
				var CurrentIndicator:ShipCargoIndicator = new ShipCargoIndicator(CurrnetCargo);
				CurrentIndicator.LoadFromOwner();	// Заполнить данными из Owner
//				ImgBorder.DrawBorder(CurrentIndicator);
				Add(CurrentIndicator);
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}