package Vn.Actions {
	// Класс действия "скролл вдоль локальной оси"
//-----------------------------------------------------------------------------------------------------
	import Vn.Objects.VnObject;
	import Vn.Objects.VnObjectT;
	import Vn.Math.pNumber;
//-----------------------------------------------------------------------------------------------------
	public class ActionSC extends Action {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		public var Axis:String;			// Ось
		public var Direction:Boolean;		// true - "+", false - "-"
		public var Once:Boolean;			// true - один раз, false - до отмены
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ActionSC(NewAxis:String,NewDirection:Boolean,NewOnce:Boolean) {
			// Конструктор предка
			super();
			// Конструктор
			Id = "ACT_SC";
			Axis = NewAxis;
			Direction = NewDirection;
			Once = NewOnce;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function PerformAction(Obj:VnObject):void {
			// Выполнить действие для объекта Obj
			// Путь за итерацию
			var Vay:pNumber = new pNumber();
			// Направление
			Vay.v = VnObjectT(Obj).IterationVay();
			if(Direction==false) Vay.v = - Vay.v;
			if(Once==false) {
				// Постоянное движение до отмены
				VnObjectT(Obj).MoveOn(Axis,Vay,true);
			}
			else {
				// Однократное движение
				Completed = VnObjectT(Obj).MoveOn(Axis,Vay,true);
			}
		}
//-----------------------------------------------------------------------------------------------------
		override public function Correct(NewAction:Action):void {
			// Откорректировать данные текущего действия по данным переданным через NewAction
			Completed = NewAction.Completed;
			Axis = ActionSC(NewAction).Axis;
			Direction = ActionSC(NewAction).Direction;
			Once = ActionSC(NewAction).Once;
		}
//-----------------------------------------------------------------------------------------------------
	}
}