package Vn.Interface.CheckBox {
	// Класс
//-----------------------------------------------------------------------------------------------------
	import flash.text.TextField;
	import flash.text.TextFieldAutoSize;
	import flash.events.Event;
	import flash.events.MouseEvent;
	import Vn.Objects.VnObjectSA;
	import Vn.Interface.Text.VnText;
//-----------------------------------------------------------------------------------------------------
	public class CheckBox extends VnObjectSA {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		protected var Txt:VnText;		// Текст
		private var IsChecked:Boolean;	// true - отмечена, false - нет
		// Константы событий
		public static const CHANGED:String = "EvChanged";	// "Состояние изменилось"
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function CheckBox() {
			// Конструктор родителя
			super();
			// Конструктор
			Name = 31;
			ReLoadById(57);	// checkbox
			Checked = false;
			Txt = new VnText();
			Txt.x = 30;
			addChild(Txt);
			// Регистрация событий
			addEventListener(MouseEvent.CLICK,OnClick);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			// Отрегистрировать события
			removeEventListener(MouseEvent.CLICK,OnClick);
			removeChild(Txt);
			Txt = null;
			// Деструктор родителя
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		public function OnClick(e:Event):void {
			// Нажатие
			if(Checked==true) Checked = false;	// Была отмечена - снять
			else Checked = true;				// Не было отметки - поставить
			dispatchEvent(new Event(CheckBox.CHANGED));
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get Text():String {
			return Txt.Text;
		}
//-----------------------------------------------------------------------------------------------------
		public function set Text(Value:String):void {
			Txt.Text = Value;
		}
//-----------------------------------------------------------------------------------------------------
		public function get Checked():Boolean {
			return IsChecked;
		}
//-----------------------------------------------------------------------------------------------------
		public function set Checked(Value:Boolean):void {
			IsChecked = Value;
			if(Value==true) ShowFrame(1);
			else ShowFrame(0);
		}
//-----------------------------------------------------------------------------------------------------
	}
}