package Vn.SpaceObjects {
//-----------------------------------------------------------------------------------------------------
// Реальный космический объект
//-----------------------------------------------------------------------------------------------------
	import Vn.Math.Vector2;
	import Vn.SpaceObjects.Orbit.OrbitFuncVn;
	import Vn.SpaceObjects.Orbit.OrbitImage;
//-----------------------------------------------------------------------------------------------------
	public class InteractiveSpaceObjectRO extends InteractiveSpaceObjectR {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		protected var OrbitFunc:OrbitFuncVn;	// Функционал орбиты
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function InteractiveSpaceObjectRO() {
			// Конструктор предка
			super();
			// Конструктор
			// Изображение для орбиты
			lSpaceObjectImage = new OrbitImage();
			addChild(lSpaceObjectImage);
			// Т.к. данный класс служит контейнером для изображения - постоянные размеры 10х10
			SetLocalPosition(10.0,10.0);
			// Функционал орбиты
			OrbitFunc = new OrbitFuncVn();
			}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			OrbitFunc._delete();
			OrbitFunc = null;
			// Удалить изображение
			removeChild(lSpaceObjectImage);
			OrbitImage(lSpaceObjectImage)._delete();
			lSpaceObjectImage = null;
			// Деструктор предка
			super._delete();
			}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public function SetRadius(NewL:Number,NewS:Number):void {
			// Установить новые радиусы эллипса
			if(NewL>=0.0&&NewS>=0.0) {
				OrbitFunc.SetRadius(NewL, NewS);
				OrbitImage(lSpaceObjectImage).SetRadius(NewL, NewS);
			}
		}
//-----------------------------------------------------------------------------------------------------
		public function SetAngle(NewA:Number):void {
			// Установить новый угол наклона эллипса
			OrbitFunc.SetAngle(NewA);
			OrbitImage(lSpaceObjectImage).SetAngle(NewA);
		}
//-----------------------------------------------------------------------------------------------------
		public function SetSpeed(NewS:Number):void {
			// Установить новую скорость движения по эллипсу
			OrbitFunc.SetSpeed(NewS);
		}
//-----------------------------------------------------------------------------------------------------
		override public function CountPos(Time:Number):Vector2 {
			// Вычислить положение объекта на орбите в момент времени Time (мс)
			return OrbitFunc.CountPos(this, Time);
		}
//-----------------------------------------------------------------------------------------------------
		override public function LoadFromXML(Data:XML):void {
			// Заполнение данными из XML
			// Общие данные
			super.LoadFromXML(Data);
			// Конкретные данные
			SetRadius(Data.child("radius_l"),Data.child("radius_s"));
			SetSpeed(Data.child("speed"));
			if(Data.child("angle")!=0) SetAngle(Data.child("angle"));
		}
//-----------------------------------------------------------------------------------------------------
		override public function Redraw():void {
			// Перерисовка объекта
			lSpaceObjectImage.Redraw();
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get RadiusAverage():Number {
			return OrbitFunc.RadiusAverage;
		}
//-----------------------------------------------------------------------------------------------------
		public function get RadiusL():Number {
			// Большой радиус
			return OrbitFunc.RadiusL;
		}
//-----------------------------------------------------------------------------------------------------
		public function get RadiusS():Number {
			// Малый радиус
			return OrbitFunc.RadiusS;
		}
//-----------------------------------------------------------------------------------------------------
		public function get Angle():Number {
			// Угол наклона
			return OrbitFunc.Angle;
		}
//-----------------------------------------------------------------------------------------------------
		public function get Speed():Number {
			// Скорость движения по орбите
			return OrbitFunc.Speed;
		}
//-----------------------------------------------------------------------------------------------------
	}
}