package Vn.Interface.List {
//-----------------------------------------------------------------------------------------------------
// Список объектов ImageListSelect с выбором отдельного объекта.
// Стрелка по низу объекта
//-----------------------------------------------------------------------------------------------------
	import Vn.Math.Vector2;
	import Vn.Objects.VnObjectS;
	import Vn.Objects.VnObjectT;
//-----------------------------------------------------------------------------------------------------
	public class ImageListSelectAB extends ImageListSelect {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lSelectArrow:VnObjectS;	// Стрелка для выделения
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ImageListSelectAB(Center:Vector2) {
			// Конструктор предка
			super(Center);
			// Конструктор
			lSelectArrow = new VnObjectS();
			lSelectArrow.ReLoadById(49);	// selectarrow
			lSelectArrow.visible = false;
			addChild(lSelectArrow);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструтор
			ClearItemSelection();
			removeChild(lSelectArrow);
			lSelectArrow._delete();
			lSelectArrow = null;
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function DrawItemSelection(SelectedItem:Object):void {
			// Отрисовка выделения объекта SelectedItem
			var SelectedItemCenter:Vector2 = GlobalToLocal(VnObjectT(SelectedItem).GetPosition());	// Центр выделяемого объекта в координатах предка
			lSelectArrow.MoveIntoParent(SelectedItemCenter.X, SelectedItemCenter.Y+VnObjectT(SelectedItem).Height05+lSelectArrow.Height05, true);
			lSelectArrow.visible = true;
		}
//-----------------------------------------------------------------------------------------------------
		override protected function ClearItemSelection():void {
			// Снятие отрисовки выделеиня со всех объектов
			lSelectArrow.visible = false;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}