package Vn.Interface.List {
//-----------------------------------------------------------------------------------------------------
// Список объектов ImageListSelect с выбором отдельного объекта.
// Обводка квадратом по размеру объекта, заполненным цветом.
//-----------------------------------------------------------------------------------------------------
	import Vn.Math.Vector2;
	import Vn.Objects.VnObjectT;
//-----------------------------------------------------------------------------------------------------
	public class ImageListSelectQ extends ImageListSelect {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lSelectionColor:Number;	// Цвет заполнения
		private var lSelectionAlpha:Number;	// Прозрачность заполнения
		private var lLineColor:Number;		// Цвет линии
		private var lLineThickness:Number;	// Толщина линии
		private var lLineAlpha:Number;		// Прозрачность линии
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ImageListSelectQ(Center:Vector2) {
			// Конструктор предка
			super(Center);
			// Конструктор
			lSelectionColor = 0xff0000;
			lSelectionAlpha = 0.4;
			lLineColor = 0xff0000;
			lLineThickness = 2;
			lLineAlpha = 0.5;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструтор
			ClearItemSelection();
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function DrawItemSelection(SelectedItem:Object):void {
			// Отрисовка выделения объекта SelectedItem
			if (SelectedItem != null) {
				graphics.lineStyle(lLineThickness,lLineColor,lLineAlpha);
				// Цветной прямоугольник на всю площадь выбранного объекта
				var LT:Vector2 = GlobalToLocal(VnObjectT(SelectedItem).GetPositionLT());	// Левый верхний угол выделяемого объекта в координатах предка
				graphics.beginFill(lSelectionColor, lSelectionAlpha);
				graphics.moveTo(LT.X, LT.Y);
				graphics.lineTo(LT.X + VnObjectT(SelectedItem).Width, LT.Y);
				graphics.lineTo(LT.X + VnObjectT(SelectedItem).Width, LT.Y + VnObjectT(SelectedItem).Height);
				graphics.lineTo(LT.X, LT.Y + VnObjectT(SelectedItem).Height);
				graphics.lineTo(LT.X, LT.Y);
				graphics.endFill();
			}
		}
//-----------------------------------------------------------------------------------------------------
		override protected function ClearItemSelection():void {
			// Снятие отрисовки выделеиня со всех объектов
			graphics.clear();
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}