package Vn.ShipsMarket {
//-----------------------------------------------------------------------------------------------------
// Класс "Кнопка "Космосалон" маленькая (S)
//-----------------------------------------------------------------------------------------------------
	import Vn.Interface.Button.ButtonWL;
	import Vn.Interface.Button.ButtonWLFuncVn;
	import Vn.Interface.Window.VnWindow;
	import Vn.SpaceObjects.SpaceObject;
	import Vn.Text.TextDictionary;
	import Vn.Interplanety;
//-----------------------------------------------------------------------------------------------------
	public class SButton extends ButtonWL {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lPlanet:SpaceObject	// Указатель на планету
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function SButton(vPlanet:SpaceObject) {
			// Конструктор предка
			lPlanet = vPlanet;
			super();
			// Конструктор
			Name = 109;
			ReLoadById(76);	// S
			Script = "checkshipsonplanet.php";	// Для открытия окна смотрим только наличие кораблей на верфи
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function SetScriptParams():void {
			// Задать входные параметры для работы скрипта
			ButtonWLFuncVn(WindowFunc).AddScriptVariable("PlanetId",String(lPlanet.Id));
		}
//-----------------------------------------------------------------------------------------------------
		override protected function CreateWindowL(ScriptData:*):VnWindow {
			// Создать окно
			if(ScriptData!="0") {
				// Окно открываем если на планете есть хоть один корабль
				var SubWindow:VnWindow = new ShipsMarketWindow(lPlanet.Id);
				SubWindow.Caption.Text = TextDictionary.Text(lPlanet.Name) + " - " + TextDictionary.Text(Name);
				SubWindow.Leader = this;
				return SubWindow;
			}
			else {
				Vn.Interplanety.Cons.Add(TextDictionary.Text(119));	// "Для получения данных нужно отправить сюда хотя бы один корабль"
				return null;
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}