package Vn.Common {
	// Класс - перечень статических констант.
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	public class SC {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		// Анимация спрайтов
		public static const ANIM_NONE:uint = 0;		// Не проигрывать анимацию
		public static const ANIM_CIRCLE:uint = 1;	// Проигрывать анимацию циклически
		// Цвет текста
		public static const TEXT_COLOR:uint = 0xff0000;	// Красный
		// Цвета
		public static const BLACK:uint = 0x000000;	// Черный
		public static const GREY:uint = 0x444444;	// Серый
		public static const YELLOW:uint = 0xF8D830;	// Желтый
		public static const BLUE:uint = 0x0000FF;	// Синий
		// Скорость
		public static const BASE_SHIP_SPEED:uint = 100;		// Базовая (единичная) скорость корабля
		// Выравнивание
		public static const TOP:uint = 0;
		public static const MIDDLE:uint = 1;
		public static const BOTTOM:uint = 2;
		public static const LEFT:uint = 3;
		public static const RIGHT:uint = 4;
		public static const CENTER:uint = 5;
		// Граница скроллируемой области карты
		public static const ScrollBorder:uint = 15;	// По 15 pix с каждого края
		// Идентификатор, что вызов php-скрипта идет из программы (а не просто зашли через браузер)
		// Его также нужно указать в /include/common.php
		public static const PROGRAM_IDENTIFICATOR:String = "interplanety";
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function SC() {
			super();
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}