package Vn.User.Attributes {
	// Кристаллы
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.Interplanety;
	import Vn.Scene.Interface.CrystalsInfo;
	import Vn.User.User;
//-----------------------------------------------------------------------------------------------------
	public class Crystals extends UserAttribute {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function Crystals() {
			// Конструктор предка
			super();
			// Конструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function SetScriptParams():void {
			// Задать входные параметры для работы скрипта
			AddScriptParam("Type","C");
		}
//-----------------------------------------------------------------------------------------------------
		public static function CreateIndicator():CrystalsInfo {
			// Создать индиктора для отображения
			var Ind:CrystalsInfo = new CrystalsInfo();
			return Ind;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		override public function set Count(NewValue:uint):void {
			super.Count = NewValue;
			Vn.Interplanety.VnUser.dispatchEvent(new Event(User.CRYSTALS_CHANGED));	// Сообщить что кол-во кристаллов юзера изменилось
		}
//-----------------------------------------------------------------------------------------------------
	}
}