package Vn.Interface.Button {
//-----------------------------------------------------------------------------------------------------
// Класс "Кнопка по нажатию на которую создается и удаляется окно по полученным данным"
// Окно создается только если получены данные с сервера
// Данные с сервера возвращаются в XML-формате
//-----------------------------------------------------------------------------------------------------
	import Vn.Interface.Window.VnWindow;
//-----------------------------------------------------------------------------------------------------
	public class ButtonWL extends ButtonW {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ButtonWL() {
			// Конструктор родителя
			super();
			// Конструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор родителя
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function SetButtonWFunc():void {
			// Подключение функционала управления окном
			WindowFunc = new ButtonWLFuncVn();
			WindowFunc.CreateWindowFunction = CreateWindowL;
			SetScriptParams();
		}
//-----------------------------------------------------------------------------------------------------
		protected function CreateWindowL(ScriptData:*):VnWindow {
			// Окно создается на основе данных полученных после выполнеиня скрипта
			// Для переопределения в наследниках
			return null;
		}
//-----------------------------------------------------------------------------------------------------
		protected function SetScriptParams():void {
			// Задание входных параметров для скрипта
			// Переопределяется в наследниках
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function set Script(vValue:String):void {
			// Скрипт для получения данных
			ButtonWLFuncVn(WindowFunc).Script = vValue;
		}
//-----------------------------------------------------------------------------------------------------
	}
}