package Vn.Interface.Button {
	// Класс "Кнопка "Далее"
//-----------------------------------------------------------------------------------------------------
	import Vn.Math.Vector2;
	import Vn.Common.SC;
	import Vn.Objects.VnObjectT;
//-----------------------------------------------------------------------------------------------------
	public class NextButton extends Button {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var VertAlign:uint;	// Вертикальное выравнивание
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function NextButton() {
			// Конструктор родителя
			super();
			// Конструктор
			NeedPlace = true;
			Name = 44;
			ReLoadById(13);	// arrowright
			VAlign = SC.MIDDLE;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function GetPlace():Vector2 {
			// Возвращает местоположение кнопки
			if(stage!=null) {
				// Если добавлена в список отображения
				switch (VertAlign) {
					case SC.TOP:
							// правый верхний угол парента
						return new Vector2(VnObjectT(parent).Width-Width05-1,Height05);
						break;
					case SC.MIDDLE:
							// справа по середине парента
						return new Vector2(VnObjectT(parent).Width-Width05-1,VnObjectT(parent).Height05);
						break;
					case SC.BOTTOM:
							// правый нижний угол парента
						return new Vector2(VnObjectT(parent).Width-Width05-1,VnObjectT(parent).Height-Height05);
						break;
				}
			}
			return new Vector2(0.0,0.0);
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
	
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function set VAlign(Value:uint):void {
			if(Value<=SC.BOTTOM||Value>=SC.TOP) VertAlign = Value;
		}
//-----------------------------------------------------------------------------------------------------
	}
}