package Vn.Interface.Pages {
	// Страничный компонент с кнопками перелистывания странци
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.Math.Vector2;
	import Vn.Interface.Scroll.ScrollPagesB;
//-----------------------------------------------------------------------------------------------------
	public class PagesB extends PagesVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var Scroller:ScrollPagesB;	// Кнопки "вперед"-"назад"
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function PagesB(Size:Vector2) {
			// Конструктор предка
			super(Size);
			// Конструктор
			// Скроллер страниц
			Scroller = new ScrollPagesB(Size);
			Scroller.addEventListener(ScrollPagesB.NEXT,ButtonNextClicked);
			Scroller.addEventListener(ScrollPagesB.PREV,ButtonPrevClicked);
			addChild(Scroller);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			// Скроллер страниц
			Scroller.removeEventListener(ScrollPagesB.NEXT,ButtonNextClicked);
			Scroller.removeEventListener(ScrollPagesB.PREV,ButtonPrevClicked);
			removeChild(Scroller);
			Scroller._delete();
			Scroller = null;
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		protected function ButtonPrevClicked(e:Event):void {
			if(CurrentPage>1) {
				CurrentPage--;
				ShowCurrentPage();
			}
		}
//-----------------------------------------------------------------------------------------------------
		protected function ButtonNextClicked(e:Event):void {
			if(CurrentPage<Pages) {
				CurrentPage++;
				ShowCurrentPage();
			}
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get ClientX():uint {
			// Начало клиентской части страницы (X от кнопки Prev)
			return Scroller.ClientX;
		}
//-----------------------------------------------------------------------------------------------------
		public function get ClientY():uint {
			// Начало клиентской части страницы (Y от кнопки Prev)
			return Scroller.ClientY;
		}
//-----------------------------------------------------------------------------------------------------
		public function get ClientWidth():uint {
			// Ширина клиентской области
			return Scroller.ClientWidth;
		}
//-----------------------------------------------------------------------------------------------------
		public function get ClientHeight():uint {
			// Высота клиентской области
			return Scroller.ClientHeight;
		}
//-----------------------------------------------------------------------------------------------------
	}
}