package Vn.Interface.Pages {
	// Страничный компонент с размещением объктов на разных страницах
	// с выбором страниц по нажатию кнопок
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.Math.Vector2;
	import Vn.Interface.Button.Button;
//-----------------------------------------------------------------------------------------------------
	public class PagesP extends PagesVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var ButtonsArray:Array;	// Массив кнопок для открытия страниц
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function PagesP(Size:Vector2) {
			// Конструктор предка
			super(Size);
			// Конструктор
			ButtonsArray = new Array();
//			// Изначально страниц нет
//			CurrentPage = 0;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			// Удалить кнопки
			if(ButtonsArray!=null) {
				for(var i:uint=0;i<ButtonsArray.length;) {
					if(ButtonsArray[i]!=null&&ButtonsArray[i]!=undefined) {
						removeChild(ButtonsArray[i]);
						ButtonsArray[i].removeEventListener(Button.CLICKED,ShowPageByButton);
						ButtonsArray[i]._delete();
						ButtonsArray.splice(i,1);
					}
				}
				ButtonsArray = null;
			}
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public function AddNewPageButton(vPageNumber:uint, ImgId:uint):void {
			// Создать кнопку с изображением ImgId для открытия страницы vPageNumber
			var PageButton:Button = new Button();
			PageButton.ReLoadById(ImgId);
			PageButton.addEventListener(Button.CLICKED,ShowPageByButton);
			PageButton.Id = vPageNumber;
			// Добавить в массив кнопок
			ButtonsArray.push(PageButton);
			// Перерасположить все кнопки в ряд
			ShowPageButtons();
		}
//-----------------------------------------------------------------------------------------------------
		private function ShowPageButtons():void {
			// Показ кнопок для выбора страниц
			for(var i:uint=0;i<ButtonsArray.length;i++) {
				// Если кнопка не показана - вывести ее
				if(ButtonsArray[i].parent==null) addChild(ButtonsArray[i]);
				ButtonsArray[i].MoveIntoParent((ButtonsArray[i].Width+5)*i+5+Width-(ButtonsArray[i].Width+5)*ButtonsArray.length,ButtonsArray[i].Height05+5,true);
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		private function ShowPageByButton(e:Event):void {
			// Выбор страницы по кнопке
			ShowPage(e.target.Id);
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}