package Vn.Ships.Routes.Events {
	// Событие "Завершение маршрута"
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
//-----------------------------------------------------------------------------------------------------
	public class EvRouteFinish extends Event {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lPlanetAId:uint;		// Id планеты старта
		private var lPlanetBId:uint;		// Id планеты назначения
		// Константа события
		public static const ROUTE_FINISH:String = "EvRouteFinish";	// Идентификатор "маршрут завершен"
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function EvRouteFinish(type:String, vPlanetAId:uint, vPlanetBId:uint, bubbles:Boolean=false, cancelable:Boolean=false) {
			// Конструктор предка
			super(type,bubbles,cancelable);
			// Конструктор
			lPlanetAId = vPlanetAId;
			lPlanetBId = vPlanetBId;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			// Деструктор
			
//			// Деструктор предка
//			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get PlanetAId():uint {
			return lPlanetAId;
		}
//-----------------------------------------------------------------------------------------------------
		public function get PlanetBId():uint {
			return lPlanetBId;
		}
//-----------------------------------------------------------------------------------------------------
	}
}