package Vn.Quests {
//-----------------------------------------------------------------------------------------------------
// Квестовое окно с текстом
//-----------------------------------------------------------------------------------------------------
	import Vn.Common.SC;
	import Vn.Interface.Text.VnTextScroll;
	import Vn.Quests.Prizes.QuestPrizeWindow;
	import Vn.Text.TextDictionary;
//-----------------------------------------------------------------------------------------------------
	public class QuestWindow extends QuestPrizeWindow {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var QuestText:VnTextScroll;	// Текст со скроллом
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function QuestWindow() {
			// Конструктор предка
			super();
			// Конструктор
			SetLocalPosition(250,200);
			// Текст
			QuestText = new VnTextScroll(WorkSpace.Width,WorkSpace.Height-60); // Высота на 60 пикс меньше (место для кнопки ОК)
			addChild(QuestText);
			QuestText.TextColor = SC.BLACK;
			QuestText.MoveIntoParent(Width05,QuestText.Height05+WorkSpace.Y,true);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			removeChild(QuestText);
			QuestText._delete();
			QuestText = null;
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function LoadFromXML(Data:XML):void {
			// Загрузка данных из XML-узла
			PrizeId = uint(Data.attribute("id"));
			QuestId = uint(Data.attribute("quest_id"));
			QuestStage = uint(Data.attribute("stage"));
			Name = uint(Data.attribute("name"));
			Caption.Text = TextDictionary.Text(Name);
			// По каждому призу - сформировать сообщение о его получении
			for each (var Node:XML in Data.children()[0].*) {
				if(Node.nodeKind()=="element") {
					QuestText.HtmlText = TextDictionary.Text(uint(Node));
				}
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}