package Vn.Market.Events {
	// Событие "Торговля производством"
//-----------------------------------------------------------------------------------------------------
	import flash.events.*;	// Для работы с событиями
//-----------------------------------------------------------------------------------------------------
	public class EvCargoTrade extends Event {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		public var CargoId:uint;	// Id купленной продукции производства
		public var Count:uint;		// Количество купленной продукции
		public var PlanetAId:uint;	// Id планеты на которой произошла покупка
		public var PlanetBId:uint;	// Id планеты на которой произошла продажа
		// Константы событий
		public static const BUY:String = "EvCargoTrageBuy";		// Покупка
		public static const SELL:String = "EvCargoTradeSell";	// Продажа
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function EvCargoTrade(type:String, vCargoId:uint, IndCount:uint, PlAId:uint, PlBId:uint, bubbles:Boolean=false, cancelable:Boolean=false) {
			// Конструктор предка
			super(type,bubbles,cancelable);
			// Конструктор
			CargoId = vCargoId;
			Count = IndCount;
			PlanetAId = PlAId;
			PlanetBId = PlBId;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			// Деструктор
			
//			// Деструктор предка
//			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}