package Vn.Scene.StarSystem
{
//-----------------------------------------------------------------------------------------------------
// Кнопка "Виртуальная вселенная"
//-----------------------------------------------------------------------------------------------------
	import flash.events.MouseEvent;
	import Vn.Interface.Button.Button;
	import Vn.Interplanety;
//-----------------------------------------------------------------------------------------------------
	public class VirtualStarSystemButton extends Button {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var l_RealStarSystemId:uint;	// Id реальной звездной системы (последняя, которая была загружена)
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function VirtualStarSystemButton() {
			// Конструктор родителя
			super();
			// Конструктор
			Name = 183;			// Виртуальная вселенная (vn_text)
			ReLoadById(180);	// virtualuniversity (vn_graphic)
			l_RealStarSystemId = 0;	// 0 - Виртуальная система не загружена, Id реальной не нужен
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор родителя
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		override protected function OnClick(e:MouseEvent):void {
			// Нажатие
			if (l_RealStarSystemId == 0) {
				// Загрузить виртуальную звездную систему
				l_RealStarSystemId = Vn.Interplanety.Universe.CurrentStarSystem.Id;	// Сохранить Id системы, из которой ушли (для возврата)
				Vn.Interplanety.Universe.ReloadStarSystem(0);
			}
			else {
				// Загрузить (вернуть обратно) реальную звездную систему
				Vn.Interplanety.Universe.ReloadStarSystem(l_RealStarSystemId);
				l_RealStarSystemId = 0;
			}
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}