package Vn.Industry {
//-----------------------------------------------------------------------------------------------------
// Кнопка вызова окна с производствами и торговлей - маленькая кнопка (i)
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.Interface.Button.ButtonW;
	import Vn.Interface.Window.VnWindow;
	import Vn.SpaceObjects.SpaceObject;
	import Vn.Market.MarketWindowVn;
//-----------------------------------------------------------------------------------------------------
	public class IButton extends ButtonW {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lPlanet:SpaceObject	// Указатель на планету
//		protected static var SingleWindow:VnWindow = null;	// Окно всегда одно - поэтому указатель на единственное открытое окно
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function IButton(vPlanet:SpaceObject) {
			// Конструктор предка
			lPlanet = vPlanet;
			super();
			// Конструктор
			Name = 34;				// Рынок
			ReLoadById(36);			// i
			WindowFunc.SceneAttach = false;	// Окно цеплять к интерфейсу
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function CreateWindow():VnWindow {
			// Создать окно (контейнер.картинка.spaceobject)
/*			if(SingleWindow!=null) {
				SingleWindow.Close();
				SingleWindow = null;
			}
*/			var SubWindow:VnWindow = new MarketWindowVn(lPlanet);	// Передать указатель на SpaceObject
//			SingleWindow = SubWindow;
//			SubWindow.Leader = this;
			return SubWindow;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
/*		override public function OnWindowClosed(e:Event):void {
			// Закрытие окна
			super.OnWindowClosed(e);
			if(SingleWindow!=null) SingleWindow = null;
		}
*/
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}