package Vn.Industry {
//-----------------------------------------------------------------------------------------------------
// Менеджер производств. Содержит список типов производств по всей вселенной
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.List.ObjectsListLVn;
	import Vn.User.User;
	import Vn.Interplanety;
//-----------------------------------------------------------------------------------------------------
	public class IndustryManagerVn extends ObjectsListLVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function IndustryManagerVn() {
			// Конструктор предка
			super();
			// Конструктор
			Script = "getindustries.php";
			Vn.Interplanety.VnUser.addEventListener(User.LEVEL_UP,RefreshIndustryList);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, Sавтоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			Vn.Interplanety.VnUser.removeEventListener(User.LEVEL_UP,RefreshIndustryList);
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public function LoadIndustries(vStarSystemId:uint):void {
			// Загрузка производств для звездной систеы StarSystemId
			AddScriptParam("StarSystemId", String(vStarSystemId));
			Load();
		}
//-----------------------------------------------------------------------------------------------------
		override protected function CreateListFromXML(Data:XML):void {
			// Создание списка по полученным XML-данным
			for each (var Node:XML in Data.*) {
				if(Node.nodeKind()=="element") {
					var CurrentIndustry:Industry = Industry(ById(uint(Node.attribute("id"))));
				}
			}
		}
//-----------------------------------------------------------------------------------------------------
		override public function ById(vId:uint):Object {
			// Возвратить указатель на объект по его Id
			var RetObject:Industry = Industry(super.ById(vId));
			if (RetObject == null) {
				RetObject = new Industry(vId);
				RetObject.Load();
				Add(RetObject);
			}
			return RetObject;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		private function RefreshIndustryList(e:Event):void {
			// Обновить список производств
			Refresh();
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}