package Vn.Ships {
//-----------------------------------------------------------------------------------------------------
// Класс "Кнопка вызова информации по модели корабля"
//-----------------------------------------------------------------------------------------------------
	import flash.system.System;
	import Vn.Interface.Button.ButtonWL;
	import Vn.Interface.Button.ButtonWLFuncVn;
	import Vn.Interface.Window.VnWindow;
	import Vn.ShipsMarket.BuyShipContainer;
//-----------------------------------------------------------------------------------------------------
	public class ShipModelInfoButton extends ButtonWL {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lShipType:uint;	// Тип корабля
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ShipModelInfoButton(vShipType:uint):void {
			lShipType = vShipType;
			super();
			Name = 56;
			Script = "getshipmodelinfo.php";
			ReLoadById(38);	// info
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function SetScriptParams():void {
			// Задать входные параметры для работы скрипта
			ButtonWLFuncVn(WindowFunc).AddScriptVariable("ShipId",String(lShipType));
		}
//-----------------------------------------------------------------------------------------------------
		override protected function CreateWindowL(ScriptData:*):VnWindow {
			// Создание окна по полученным данным
			// Приходит XML с описанием корабля
			try {
				var ShipData:XML = new XML(ScriptData);
			}
			catch(e1:Error) {
				trace(ScriptData);
			}
			if (ShipData != "") {
				var NewWindow:VnWindow = new ShipModelInfoWindow(ShipData.children()[0]);
				NewWindow.Leader = this;
				System.disposeXML(ShipData);
				return NewWindow;
			}
			else {
				System.disposeXML(ShipData);
				return null;
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}