package Vn.Graphic {
	// Класс "данные об изображении"
	// (просто контейнер)
//-----------------------------------------------------------------------------------------------------
	
//-----------------------------------------------------------------------------------------------------
	public class ImgInfo {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		public var Id:uint;		// Id
		public var ObjectType:String;	// Тип объекта к которому относится изображение
		public var ObjectId:uint;		// Id объекта к которому относится изображение
		public var Path:String;	// Путь к изображению (без последнего слеша)
		public var Name:String;	// Имя файла изображения
		public var Ext:String;		// Расширение
		public var Frames:uint;		// Количество кадров
		public var Cx:Number;			// X координата центра
		public var Cy:Number;			// Y координата центра
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ImgInfo() {
			// Конструктор предка
//			super();
			// Конструктор
			Id = 129;			// Default в vn_graphic
			ObjectType = "";
			ObjectId = 0;
			Path = "graphic";
			Name = "default";
			Ext = "png";
			Frames = 1;
			Cx = 21.5;
			Cy = 21.5;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			// Деструктор
			
			// Деструктор предка
//			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public function toString():String {
			// Возвращает информацию о векторе в текстовом виде
			return "Id="+String(Id)+" "+" ("+ObjectType+"/"+String(ObjectId)+") "+Path+"/"+Name+"."+Ext+" ["+String(Cx*2)+", "+String(Cy*2)+"] ("+String(Frames)+")"
		}
//-----------------------------------------------------------------------------------------------------
		public function Clone():ImgInfo {
			// Создает копию текущего объекта и возвращает на нее указатель
			var Clone:ImgInfo = new ImgInfo();
			Clone.Id = Id;
			Clone.ObjectType = ObjectType;
			Clone.ObjectId = ObjectId;
			Clone.Path = Path;
			Clone.Name = Name;
			Clone.Ext = Ext;
			Clone.Frames = Frames;
			Clone.Cx = Cx;
			Clone.Cy = Cy;
			return Clone;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get Width():Number {
			return Cx * 2.0;
		}
//-----------------------------------------------------------------------------------------------------
		public function get Height():Number {
			return Cy * 2.0;
		}
//-----------------------------------------------------------------------------------------------------
	}
}