package Vn.Virtual.Prizes {
//-----------------------------------------------------------------------------------------------------
// Контейнер с кнопками "удалить приз", "изменить параметры приза" и "переместить приз"
//-----------------------------------------------------------------------------------------------------
	import Vn.Interface.Button.ButtonMVn;
	import Vn.Interface.Button.RadioButtonVn;
//-----------------------------------------------------------------------------------------------------
	public class PrizesButtonMDVn extends RadioButtonVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function PrizesButtonMDVn() {
			// Конструктор предка
			super();
			// Конструктор
			SetLocalPosition(10 + 3 + 10, 10 + 1 + 10);	// 20 + 6 + 20 x 20 + 2 + 20
			// Кнопка модификации параметров призов
			var NewButton:ButtonMVn = AddButton();
			NewButton.ReLoadById(184);	// modify
			NewButton.Name = 189;		// "Настройка параметров"
			NewButton.MoveIntoParent(NewButton.Width05, NewButton.Height05);
			// Кнопка удаления призов
			NewButton = AddButton();
			NewButton.ReLoadById(182);	// del
			NewButton.Name = 187;		// "Удалить приз в хранилище"
			NewButton.MoveIntoParent(26 + NewButton.Width05, NewButton.Height05);
			// Кнопка перемещения призов
			NewButton = AddButton();
			NewButton.ReLoadById(185);	// move
			NewButton.Name = 195;		// "Перемещение"
			NewButton.MoveIntoParent(Width05, Height - NewButton.Height05);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}