package Vn.Quests.Conditions.Picts {
	// "Инструктаж"
//-----------------------------------------------------------------------------------------------------
	import Vn.Objects.VnObjectS;
	import Vn.Text.TextDictionary;
//-----------------------------------------------------------------------------------------------------
	public class QuestConditionTextPictVn extends QuestConditionPictVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var Baita:VnObjectS;	// Изображение Байты
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function QuestConditionTextPictVn() {
			// Конструктор предка
			super();
			// Конструктор
//			IdentifyText.width = Width+5;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			if(Baita!=null) {
				if(Baita.parent!=null) removeChild(Baita);
				Baita._delete();
				Baita = null;
			}
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function Load(Params:Object):void {
			// Не требуется ничего загружать, только заполнить из переданных параметров
			Baita = new VnObjectS();
			Baita.ReLoadById(96);	// baita40x40i
			addChild(Baita);
			Baita.MoveIntoParent(Baita.Width05,Baita.Height05,true);
			Text = TextDictionary.Text(81);	// Инструктаж
			Desc.Text = TextDictionary.Text(81);
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}