package Vn.Quests.Conditions.Picts {
	// "Level Up"
//-----------------------------------------------------------------------------------------------------
	import Vn.Objects.VnObjectS;
	import Vn.Text.TextDictionary;
//-----------------------------------------------------------------------------------------------------
	public class QuestConditionLevelUpPictVn extends QuestConditionPictVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var LUp:VnObjectS;	// Изображение уровня
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function QuestConditionLevelUpPictVn() {
			// Конструктор предка
			super();
			// Конструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			if(LUp!=null) {
				if(LUp.parent!=null) removeChild(LUp);
				LUp._delete();
				LUp = null;
			}
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function Load(Params:Object):void {
			// Не требуется ничего загружать, только заполнить из переданных параметров
			LUp = new VnObjectS();
			LUp.ReLoadById(85);	// level40x40i
			addChild(LUp);
			LUp.MoveIntoParent(Width05,LUp.Height05,true);
			Text = TextDictionary.Text(126);	// LevelUp
			Desc.Text = TextDictionary.Text(126);
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}