package Vn.SpaceObjects.Stations.Shipyard {
//-----------------------------------------------------------------------------------------------------
// Класс ShipyardInteractiveWindow - окно для Shipyard
//-----------------------------------------------------------------------------------------------------
	import Vn.SpaceObjects.ISOWindow;
	import Vn.SpaceObjects.SpaceObject;
	import Vn.Industry.IButton;
	import Vn.Dock.DButton;
	import Vn.ShipsMarket.SButton;
//-----------------------------------------------------------------------------------------------------
	public class ShipyardInteractiveWindow extends ISOWindow {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var Industry:IButton;		// Указатель на кнопку "Информация о производстве"
		private var Dock:DButton;			// Указатель на кнопку "Док"
		private var SMarket:SButton;		// Указатель на кнопку "Космосалон"
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function ShipyardInteractiveWindow(vPlanet:SpaceObject) {
			// Конструктор предка
			super(vPlanet);
			// Конструктор
			// Создать кнопки: 3 кнопки 20х20 + промежутки в 4 пикс
			SetLocalPosition(10+2+10+2+10,10);
			// Промышленность
			Industry = new IButton(vPlanet);
			addChild(Industry);
			Industry.MoveIntoParent(10,10,true);
			// Док
			Dock = new DButton(vPlanet);
			addChild(Dock);
			Dock.MoveIntoParent(34,10,true);
			// Космосалон
			SMarket = new SButton(vPlanet);
			addChild(SMarket);
			SMarket.MoveIntoParent(58,10,true);
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			removeChild(SMarket);
			SMarket._delete();
			SMarket = null;
			removeChild(Dock);
			Dock._delete();
			Dock = null;
			removeChild(Industry);
			Industry._delete();
			Industry = null;
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function Update():void {
			// Обновление
			super.Update();
			// Обновить содержимое окна
//			Industry.Update();	// Нет смысла обновлять пока сделал по низу экрана
			Dock.Update();
			SMarket.Update();
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}