package Vn.System 
{
//-----------------------------------------------------------------------------------------------------
// Контроллер для слежения за перетаскиванием Drag'n'Drop объекта
// При нажатии события мышки генерируются в порядке mouse_down - mouse_up - click
//-----------------------------------------------------------------------------------------------------
	import flash.events.MouseEvent;
//-----------------------------------------------------------------------------------------------------
	public class DragController {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		private var lDragging:Boolean;	// true - объект в данный момент перетаскивается, false - нет
		private var lDragged:Boolean;	// true - объект был действительно перетащен, false - нет
		private var OldX:Number;		// Фиксация координат для определения перемещения
		private var OldY:Number;
		private var lDragValue:Number;	// Количество пикселей при сдвиге на которое считаем, что был drag
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function DragController() {
			// Конструктор
			lDragValue = 3.0;	// Перетаскивание меньше 3 pix не считать
			lDragged = false;
			lDragging = false;
			OldX = 0.0;
			OldY = 0.0;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			// Деструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public function MouseDown(e:MouseEvent):void {
			OnMouseDown(e);
		}
//-----------------------------------------------------------------------------------------------------
		public function MouseUp(e:MouseEvent):void {
			OnMouseUp(e);
		}
//-----------------------------------------------------------------------------------------------------
		public function Click(e:MouseEvent):void {
			OnClick(e);
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		private function OnMouseDown(e:MouseEvent):void {
			// Зажатие кнопки мышки
			Dragging = true;
			OldX = e.stageX;
			OldY = e.stageY;
		}
//-----------------------------------------------------------------------------------------------------
		private function OnMouseUp(e:MouseEvent):void {
			// Отжатие кнопки мышки
			// ??? иногда при выходе курсора за пределы окна при перетаскивании вылетает с e=null
			if (e != null && Dragging == true) {
				Dragging = false;
				if (Math.abs(e.stageX - OldX) > lDragValue || Math.abs(e.stageY - OldY) > lDragValue) Dragged = true;
			}
		}
//-----------------------------------------------------------------------------------------------------
		private function OnClick(e:MouseEvent):void {
			// Клик
			if (Dragged == true) Dragged = false;
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		public function get Dragging():Boolean {	// Флаг процесса перетаскивания объекта
			return lDragging;
		}
//-----------------------------------------------------------------------------------------------------
		public function set Dragging(Value:Boolean):void {
			lDragging = Value;
		}
//-----------------------------------------------------------------------------------------------------
		public function get Dragged():Boolean {	// Флаг результата перетаскивания объекта
			return lDragged;
		}
//-----------------------------------------------------------------------------------------------------
		public function set Dragged(Value:Boolean):void {
			lDragged = Value;
		}
//-----------------------------------------------------------------------------------------------------
	}
}