package Vn.Quests.Conditions {
	// "Рост уровня"
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
	import Vn.User.User;
	import Vn.Quests.Conditions.Picts.QuestConditionLevelUpPictVn;
//-----------------------------------------------------------------------------------------------------
	public class QuestConditionLevelUpVn extends QuestConditionVn {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function QuestConditionLevelUpVn() {
			// Конструктор предка
			super();
			// Конструктор
			lEventType = User.LEVEL_UP;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override public function Load(Data:XML):void {
			// Загрузка из XML
			// Количество
			var ValueArr:Array = String(Data).split("/");
			lValue = uint(ValueArr[1]);
			// Текущее количество
			lCurrentValue = uint(ValueArr[0]);
		}
//-----------------------------------------------------------------------------------------------------
		override protected function CreatePict():void {
			// Создание пиктограммы
			lPict = new QuestConditionLevelUpPictVn();
			lPict.Load(null);
		}
//-----------------------------------------------------------------------------------------------------
		override public function QuestEventOccurse(e:Event):void {
			// Произошло событие влияющее на условие
			lCurrentValue ++;
			if(lCurrentValue>lValue) lCurrentValue = lValue;
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}