package Vn.Ships.Routes {
	// Класс "старт маршрута"
//-----------------------------------------------------------------------------------------------------
	import Vn.Math.Vector2;
	import Vn.Interface.Button.Button;
	import Vn.Text.TextDictionary;
	import Vn.Objects.VnObjectT;
//-----------------------------------------------------------------------------------------------------
	public class StartRouteButton extends Button {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function StartRouteButton() {
			// Конструктор родителя
			super();
			// Конструктор
			NeedPlace = true;
			// Текст
			ReLoadById(50);	// start
			Type = Button.BUTTON_TXT;
			Text = TextDictionary.Text(53);	// После ReLoad т.к выравнивается по центру
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		override protected function GetPlace():Vector2 {
			// Возвращает местоположение кнопки
			if(stage!=null) {
				// Если добавлена в список отображения - внизу по центру окна + 5 пикс.
				return new Vector2(VnObjectT(parent).Width05,VnObjectT(parent).Height-Height05-5);
			}
			else {
				// Если не добавлена - 0,0
				return new Vector2(0.0,0.0);
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------------
	}
}