package Vn.Objects {
	// Класс рисованых объектов
//-----------------------------------------------------------------------------------------------------
	import flash.events.Event;
//-----------------------------------------------------------------------------------------------------
	public class VnObjectD extends VnObjectR {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		public var NeedRender:Boolean;	// Указание на необходимость перерисовки т.к. событие Event.RENDER рассылается всем объектам, независимо, в каком был вызван stage.invalidate()
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function VnObjectD() {
			// Конструктор предка
			super();
			// Конструктор
			NeedRender = false;
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		override public function _delete():void {
			// Деструктор
			
			// Деструктор предка
			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		protected function Draw():void {
			// Отрисовка объекта
			
		}
//-----------------------------------------------------------------------------------------------------
		public function Clear():void {
			// Очистка объекта
			
		}
//-----------------------------------------------------------------------------------------------------
		public function Redraw():void {
			// Указание перерисовать объект (вызвать событие RENDER при следующем обновлении экрана)
			if(stage!=null) {
				NeedRender = true;
				stage.invalidate();
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		override protected function OnAddToStage(e:Event):void {
			// При добавлении в список отображения
			super.OnAddToStage(e);
			// Зарегистрировать обработку события RENDER
			addEventListener(Event.RENDER,OnRender);
			// Прорисовать объект первый раз (при добавлении в список отображения)
			Redraw();
		}
//-----------------------------------------------------------------------------------------------------
		override protected function OnRemoveFromStage(e:Event):void {
			// При удалении из списка отображения
			// Убрать обработку сообщения RENDER
			removeEventListener(Event.RENDER,OnRender);
			super.OnRemoveFromStage(e);
		}
//-----------------------------------------------------------------------------------------------------
		protected function OnRender(e:Event):void {
			// Событие обновления экрана
			// Вызывается перед обновлением, если был вызван stage.invalidate()
			if(NeedRender==true) {
				Clear();	// Очистить
				Draw();		// Отрисовать заново
				NeedRender = false;
			}
		}
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}