package Vn.Synchronize {
	// Фабрика обновлений объектов
//-----------------------------------------------------------------------------------------------------
	import Vn.Scene.StarSystem.StarSystemRealVn;
	import Vn.Interplanety;
//-----------------------------------------------------------------------------------------------------
	public class Refresher {
//-----------------------------------------------------------------------------------------------------
// Переменные
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Конструктор
//-----------------------------------------------------------------------------------------------------
		public function Refresher() {
			// Конструктор предка
//			super();
			// Конструктор
			
		}
//-----------------------------------------------------------------------------------------------------
// Деструктор - вызывать самому, автоматически не вызывается
//-----------------------------------------------------------------------------------------------------
		public function _delete():void {
			// Деструктор
			
			// Деструктор предка
//			super._delete();
		}
//-----------------------------------------------------------------------------------------------------
// Функции
//-----------------------------------------------------------------------------------------------------
		public static function Refresh(ObjectType:String, ... Args):void {
			// Вызвать обновление объекта по его типу
			switch(ObjectType) {
				case "Crystals":
					Vn.Interplanety.VnUser.RefreshCrystals();
					break;
				case "Gold":
					Vn.Interplanety.VnUser.RefreshGold();
					break;
				case "Exp":
					Vn.Interplanety.VnUser.RefreshExp();
					break;
				case "Ship":
					StarSystemRealVn(Vn.Interplanety.Universe.CurrentStarSystem).Ships.Refresh();
					break;
				case "Quest":	// Получен новый квест - обновить список квестов
					Vn.Interplanety.Universe.QuestsManager.Refresh();
					break;
			}
		}
//-----------------------------------------------------------------------------------------------------
// Обработка событий
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
// Методы get/set для установки значений переменных
//-----------------------------------------------------------------------------------------------------
		
//-----------------------------------------------------------------------------------------------------
	}
}